import pytest
from main.unique_name import get_unique_names
from main.len_courses import len_cours
from main.identical_names import identical_name

def test_unique_names():
    a =[['Иван Иванов', 'Сергей Сергеев', 'Сергей Попов', 'Артем Артемов'],
        ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек"],
	    ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин"], ]
    expected = ['Александр', 'Артем', 'Владимир', 'Евгений', 'Иван', 'Олег', 'Сергей', 'Эдгар']
    result = get_unique_names(a)
    assert result == expected

def test_len_cours():
    a = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"]
    b = [7, 9, 12, 2]
    expected = ['Frontend-разработчик с нуля']
    result = len_cours(a, b)
    assert result == expected

def test_identical():
    a = [
	["Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"]
]
    expected = ['Александр: 7 раз(а)']
    result = identical_name(a)
    assert result == expected
